/* created hyper

*/

const Asena = require('../events');

const { MessageType, MessageOptions, Mimetype } = require('@adiwajshing/baileys');

const fs = require('fs');

const axios = require('axios');

const Config = require('../config');

const Ln = "*Complete command list* "

 const code = " ​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​*✪ ᴄᴏᴍᴍᴀɴᴅ:* .ʙʀᴀɪɴʟʏ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ғɪɴᴅs ᴛʜᴇ ᴀɴsᴡᴇʀ!``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ʙʀᴀɪɴʟʏ <ϙᴜᴇsᴛɪᴏɴ>```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.xᴍᴇᴅɪᴀ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɪᴛ ɪs ᴀ ᴘʟᴜɢɪɴ ᴡɪᴛʜ ᴍᴏʀᴇ ᴛʜᴀɴ 25 ᴍᴇᴅɪᴀ ᴛᴏᴏʟs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴏᴡɴᴇʀᴄᴍɴᴅ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sᴇᴛ ᴏғ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ʙᴏᴛ ᴜsᴇʀ ᴏʀ sᴜᴅᴏ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴄᴏᴅᴛᴛs```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ʟᴀɴɢᴜᴀɢᴇ ᴄᴏᴅᴇ ᴛᴏ ᴄʜᴀɴɢᴇ ᴛʜᴇ ᴠᴏɪᴄᴇ ɪɴ .ᴛᴛs & ᴀʟsᴏ ғᴏʀ .ᴛʀᴛ ᴛʀᴀɴsʟᴀᴛɪᴏɴ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴀᴅᴀɴ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ғɪɴᴅs ᴘʀᴀʏᴇʀ ᴛɪᴍᴇ.``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ᴘʀᴀʏᴇʀ <ᴄɪᴛʏ>```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴀɴɪᴍᴇ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ʀᴀɴᴅᴏᴍ ᴀɴɪᴍᴇ ɪᴍᴀɢᴇ ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴀᴘᴋᴍᴏᴅ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ғᴀᴛᴘ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɪɴsʜᴏᴛ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴄᴀᴘᴄᴜᴛ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴊᴇᴛᴀᴜ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴛᴛᴘ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄᴏɴᴠᴇʀᴛs ᴛᴇxᴛ ᴛᴏ ᴘʟᴀɪɴ ᴘᴀɪɴᴛɪɴɢ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴀᴛᴛᴘ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴀᴅᴅs ʀᴀɪɴʙᴏᴡ ᴇғғᴇᴄᴛ ᴛᴏ ᴛʜᴇ ᴛᴇxᴛ ᴀs ᴀ sᴛɪᴄᴋᴇʀ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʙɢᴍ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴛᴜʀɴ ᴏɴ ᴀɴᴅ ᴛᴜʀɴ ᴏғғ ʙɢᴍ. -ʙᴏᴛ ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅ``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ʙɢᴍ ᴏɴ / ᴏғғ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴄᴀʀʙᴏɴ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʙɢᴍ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄʜᴀɴɢᴇ ʀᴇᴘʟʏ ᴍᴇssᴀɢᴇ ʙɢᴍ ᴍᴏᴅᴇ``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ʙɢᴍ ᴏɴᴇ / ᴛᴡᴏ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴍᴘ3```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄᴏɴᴠᴇʀᴛs ᴠɪᴅᴇᴏ ᴛᴏ sᴏᴜɴᴅ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴘʜᴏᴛᴏ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄᴏɴᴠᴇʀᴛs ᴛʜᴇ sᴛɪᴄᴋᴇʀ ᴛᴏ ᴀ ᴘʜᴏᴛᴏ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴍᴘ4```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄᴏɴᴠᴇʀᴛs ᴀɴɪᴍᴀᴛᴇᴅ sᴛɪᴄᴋᴇʀs ᴛᴏ ᴠɪᴅᴇᴏ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴅᴇᴇᴘᴀɪ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ʀᴜɴs ᴛʜᴇ ᴍᴏsᴛ ᴘᴏᴡᴇʀғᴜʟ ᴀʀᴛɪғɪᴄɪᴀʟ ɪɴᴛᴇʟʟɪɢᴇɴᴄᴇ ᴛᴏᴏʟs ᴜsɪɴɢ ᴀʀᴛɪғɪᴄɪᴀʟ ɴᴇᴜʀᴀʟ ɴᴇᴛᴡᴏʀᴋs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴅɪᴄᴛ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴜsᴇ ɪᴛ ᴀs ᴀ ᴅɪᴄᴛɪᴏɴᴀʀʏ.
ᴇɢ: .ᴅɪᴄᴛ ᴇɴ_ᴜs;ʟᴇᴀᴅ
 ғᴏʀ sᴜᴘᴘᴏʀᴛɪɴɢ ʟᴀɴɢᴜᴀɢᴇs sᴇɴᴅ *.ʟɴɢᴄᴏᴅᴇ*``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʙɢᴍ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴛᴜʀɴ ᴏɴ ᴀɴᴅ ᴛᴜʀɴ ᴏғғ ʙɢᴍ. -ʙᴏᴛ ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅ``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ʙɢᴍ ᴏɴ / ᴏғғ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴛᴜʀɴ ᴏɴ ᴀɴᴅ ᴛᴜʀɴ ᴏғғ ʙɢᴍ. -ʙᴏᴛ ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅ``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.sᴛɪᴄᴋᴇʀ ᴏɴ / ᴏғғ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.sᴜᴅᴏ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄʜᴀɴɢᴇs sᴜᴅᴏ ɴᴜᴍʙᴇʀs``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.sᴜᴅᴏ *ʏᴏᴜʀ ɴᴜᴍʙᴇʀ*```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴄᴀᴘᴛɪᴏɴ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄʜᴀɴɢᴇs ᴀʟʟ ᴄᴀᴘᴛɪᴏɴs``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ᴄᴀᴘᴛɪᴏɴ *ᴍᴀᴅᴇ ʙʏ ᴊᴜʟɪᴇᴍᴡᴏʟ*```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʜᴀɴᴅʟᴇʀs ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄʜᴀɴɢᴇs ʜᴀɴᴅʟᴇʀs``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ʜᴀɴᴅʟᴇʀ ^[.!] ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʙᴏᴛɴᴀᴍᴇ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄʜᴀɴɢᴇ ʏᴏᴜʀ ʙᴏᴛ ɴᴀᴍᴇ``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ʙᴏᴛɴᴀᴍᴇ *ɴᴀᴍᴇ* ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴛʜᴇʀɪ  ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄʜᴀɴɢᴇ ʏᴏᴜʀ ᴛʜᴇʀɪ ᴄᴏᴍᴍᴀɴᴅs``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ᴛʜᴇʀɪ ᴄᴏᴍᴍᴀɴᴅ,ᴄᴏᴍᴍᴀɴᴅ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ғғᴍᴘᴇɢ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴀᴘᴘʟɪᴇs ᴛʜᴇ ᴅᴇsɪʀᴇᴅ ғғᴍᴘᴇɢ ғɪʟᴛᴇʀ ᴛᴏ ᴛʜᴇ ᴠɪᴅᴇᴏ.
⌨️ ᴇxᴀᴍᴘʟᴇ: .ғғᴍᴘᴇɢ ғᴀᴅᴇ=ɪɴ:0:30``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɢɪᴛ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴛᴏ ɢᴇᴛ ɢɪᴛʜᴜʙ ʟɪɴᴋs|ʜᴛᴛᴘ://ɢɪᴛʜᴜʙ.ᴄᴏᴍ/ʜʏᴘᴇʀsɪʀ/ғɪᴅʜᴀ-ᴍᴡᴏʟ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴡᴇʟᴄᴏᴍᴇ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɪᴛ sᴇᴛs ᴛʜᴇ ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ. ɪғ ʏᴏᴜ ʟᴇᴀᴠᴇ ɪᴛ ʙʟᴀɴᴋ ɪᴛ sʜᴏᴡs ᴛʜᴇ ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɢᴏᴏᴅʙʏᴇ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sᴇᴛs ᴛʜᴇ ɢᴏᴏᴅʙʏᴇ ᴍᴇssᴀɢᴇ. ɪғ ʏᴏᴜ ʟᴇᴀᴠᴇ ʙʟᴀɴᴋ, ɪᴛ sʜᴏᴡ's ᴛʜᴇ ɢᴏᴏᴅʙʏᴇ ᴍᴇssᴀɢᴇ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʜᴇʟᴘ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɢɪᴠᴇs ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴜsɪɴɢ ᴛʜᴇ ʙᴏᴛ ғʀᴏᴍ ᴛʜᴇ ʜᴇʟᴘ ᴍᴇɴᴜ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴀɴᴛɪʟɪɴᴋ ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴀᴄᴛɪᴠᴀᴛᴇs ᴛʜᴇ ᴀɴᴛɪʟɪɴᴋ ᴛᴏᴏʟ.``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ᴀɴᴛɪʟɪɴᴋ ᴏɴ / ᴏғғ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʟᴏᴄᴀᴛᴇ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɪᴛ sᴇɴᴅ ʏᴏᴜʀ ʟᴏᴄᴀᴛɪᴏɴ.``` 
*⚠️ ᴡᴀʀɴ:* ```ᴘʟᴇᴀsᴇ ᴏᴘᴇɴ ʏᴏᴜʀ ʟᴏᴄᴀᴛɪᴏɴ ʙᴇғᴏʀᴇ ᴜsɪɴɢ ᴄᴏᴍᴍᴀɴᴅ!```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴍᴇᴍᴇ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴘʜᴏᴛᴏ ᴍᴇᴍᴇs ʏᴏᴜ ʀᴇᴘʟɪᴇᴅ ᴛᴏ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʟɪsᴛ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɪᴛ sᴇɴᴅ ʙᴏᴛ ᴍᴇɴᴜ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴍᴍᴘᴀᴄᴋ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```*▷🪐നിങ്ങൾ ആഗ്രഹിക്കുന്ന രീതിയിൽ മെമ്മുകൾ ഇച്ഛാനുസൃതമാക്കാൻ മെമ്മെ ലിസ്റ്റ്◁* ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴍᴏʀᴇᴛxᴛ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴍᴏʀᴇ ᴛxᴛɪᴛ ᴄᴏᴍᴍᴀɴᴅs``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ғғɪʀᴇ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴀᴅᴅ ʏᴏᴜʀ ᴛᴇxᴛ ᴛᴏ ʀᴀɴᴅᴏᴍ ғʀᴇᴇғɪʀᴇ ʟᴏɢᴏ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴇᴍᴏ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴇᴍᴏɢɪ ᴛᴏ ᴘɴɢ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɴᴇᴡs ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɴᴏᴛᴇs```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sʜᴏᴡs ᴀʟʟ ʏᴏᴜʀ ᴇxɪsᴛɪɴɢ ɴᴏᴛᴇs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.sᴀᴠᴇ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ʀᴇᴘʟʏ ᴀ ᴍᴇssᴀɢᴇ ᴀɴᴅ ᴛʏᴘᴇ .sᴀᴠᴇ ᴏʀ ᴊᴜsᴛ ᴜsᴇ .sᴀᴠᴇ <ʏᴏᴜʀ ɴᴏᴛᴇ> ᴡɪᴛʜᴏᴜᴛ ʀᴇᴘʟʏɪɴɢ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴅᴇʟᴇᴛᴇɴᴏᴛᴇs```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴅᴇʟᴇᴛᴇs *ᴀʟʟ* ʏᴏᴜʀ sᴀᴠᴇᴅ ɴᴏᴛᴇs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴏᴄʀ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ʀᴇᴀᴅs ᴛʜᴇ ᴛᴇxᴛ ᴏɴ ᴛʜᴇ ᴘʜᴏᴛᴏ ʏᴏᴜ ʜᴀᴠᴇ ʀᴇᴘʟɪᴇᴅ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴏᴡɴᴇʀ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sʜᴏᴡs ᴛʜᴇ ᴅᴇᴛᴀɪʟ ᴏғ ʙᴏᴛ ᴏᴡɴᴇʀ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴊɪᴅ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɢɪᴠɪɴɢ ᴜsᴇʀ's ᴊɪᴅ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʀᴀɴᴅᴏᴍ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴡᴏʀᴅ ɪᴍᴀɢᴇ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʙʀᴅᴍᴏʀᴇ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴀᴅᴅ ʀᴇᴀᴅᴍᴏʀᴇ ʙᴇғᴏʀᴇ ʏᴏᴜʀ ᴛᴇxᴛ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʀᴅᴍᴏʀᴇ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴀᴅᴅ ʀᴇᴀᴅᴍᴏʀᴇ ʙᴇғᴏʀᴇ ʏᴏᴜʀ ᴛᴇxᴛ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʀᴇᴍᴏᴠᴇʙɢ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ʀᴇᴍᴏᴠᴇs ᴛʜᴇ ʙᴀᴄᴋɢʀᴏᴜɴᴅ ᴏғ ᴛʜᴇ ᴘʜᴏᴛᴏs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴡᴀʀɴ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sᴇɴᴅs ʀᴇᴘᴏʀᴛs ᴛᴏ ɢʀᴏᴜᴘ ᴀᴅᴍɪɴs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.sᴄᴀɴ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄʜᴇᴄᴋs ᴡʜᴇᴛʜᴇʀ ᴛʜᴇ ᴇɴᴛᴇʀᴇᴅ ɴᴜᴍʙᴇʀ ɪs ʀᴇɢɪsᴛᴇʀᴇᴅ ᴏɴ ᴡʜᴀᴛᴀᴘᴘ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴛʀᴛ```
*⟳ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɪᴛ ᴛʀᴀɴsʟᴀᴛᴇs ᴡɪᴛʜ ɢᴏᴏɢʟᴇ ᴛʀᴀɴsʟᴀᴛᴇ. ʏᴏᴜ ᴍᴜsᴛ ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇssᴀɢᴇ.``` 
*⌨️ ᴇxᴀᴍᴘʟᴇ:* ```.ᴛʀᴛ ᴛʀ ɪᴛ (ғʀᴏᴍ ᴛᴜʀᴋɪsʜ ᴛᴏ ɪᴛᴀʟɪᴀɴ)```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴅᴇᴛᴇᴄᴛʟᴀɴɢ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɢᴜᴇss ᴛʜᴇ ʟᴀɴɢᴜᴀɢᴇ ᴏғ ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴍᴇssᴀɢᴇ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴄᴜʀʀᴇɴᴄʏ```

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴛᴛs ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɪᴛ ᴄᴏɴᴠᴇʀᴛs ᴛᴇxᴛ ᴛᴏ sᴏᴜɴᴅ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.sᴏɴɢ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴜᴘʟᴏᴀᴅs ᴛʜᴇ sᴏɴɢ ʏᴏᴜ ᴡʀᴏᴛᴇ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴠɪᴅᴇᴏ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴅᴏᴡɴʟᴏᴀᴅs ᴠɪᴅᴇᴏ ғʀᴏᴍ ʏᴏᴜᴛᴜʙᴇ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɪsᴏɴɢ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴜᴘʟᴏᴀᴅs ᴛʜᴇ sᴏɴɢ ʏᴏᴜ ᴡʀᴏᴛᴇ ғᴏʀ ɪᴏs ᴜsᴇʀs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʏᴛ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɪᴛ sᴇᴀʀᴄʜs ᴏɴ ʏᴏᴜᴛᴜʙᴇ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴡɪᴋɪ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sᴇᴀʀᴄʜᴇs ϙᴜᴇʀʏ ᴏɴ ᴡɪᴋɪᴘᴇᴅɪᴀ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɪᴍɢ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sᴇᴀʀᴄʜᴇs ғᴏʀ ʀᴇʟᴀᴛᴇᴅ ᴘɪᴄs ᴏɴ ɢᴏᴏɢʟᴇ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ɢɪᴛʜᴜʙ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ᴄᴏʟʟᴇᴄᴛs ɢɪᴛʜᴜʙ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ғʀᴏᴍ ᴛʜᴇ ɢɪᴠᴇɴ ᴜsᴇʀɴᴀᴍᴇ.
⌨️ ᴇxᴀᴍᴘʟᴇ: .ɢɪᴛʜᴜʙ ᴘʜᴀᴛɪᴄᴜsᴛʜɪᴄᴄʏ``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ʟʏʀɪᴄ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ғɪɴᴅs ᴛʜᴇ ʟʏʀɪᴄs ᴏғ ᴛʜᴇ sᴏɴɢ.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.ᴄᴏᴠɪᴅ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```sʜᴏᴡs ᴛʜᴇ ᴅᴀɪʟʏ ᴀɴᴅ ᴏᴠᴇʀᴀʟʟ ᴄᴏᴠɪᴅ ᴛᴀʙʟᴇ ᴏғ ᴍᴏʀᴇ ᴛʜᴀɴ 15 ᴄᴏᴜɴᴛʀɪᴇs.``` 

*✪ ᴄᴏᴍᴍᴀɴᴅ:* ```.sᴡᴇᴀᴛʜᴇʀ ```
*➢ ᴅᴇsᴄʀɪᴘᴛɪᴏɴ:* ```ɢɪᴠᴇs ʏᴏᴜ ᴛʜᴇ ᴡᴇᴇᴋʟʏ ɪɴᴛᴇʀᴘʀᴇᴛᴀᴛɪᴏɴs ᴏғ sᴘᴀᴄᴇ ᴡᴇᴀᴛʜᴇʀ ᴏʙsᴇʀᴠᴀᴛɪᴏɴs ᴘʀᴏᴠɪᴅᴇ" 

{

    

      Asena.addCommand({pattern: 'all', fromMe: true, desc: Ln,}, (async (message, match) => {

    await message.client.sendMessage(

  

      message.jid,code, MessageType.text);

  

  }));

  }
